//LIBTEST1 JOB (ACCT),'LIB MQ TEST',
//         CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*  Example test job that just runs LIBMQTST
//TEST    EXEC PGM=LIBMQTST,REGION=0M
//STEPLIB DD  DSN=YOUR.COBOL.LOADLIB,DISP=SHR
//        DD  DSN=YOUR.MQ.LOADLIB,DISP=SHR
//SYSOUT  DD  SYSOUT=*
//*
