//LIBMQC   JOB (ACCT),'COBOL MQ COMPILE',
//         CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*  Compile and link LIBMQTST COBOL + MQ
//*  Customize DSNs: COBOL.SRCLIB, COBOL.LOADLIB, MQ.LOADLIB, etc.
//COBOL   EXEC PGM=IGYCRCTL,REGION=0M,
//         PARM='LIB'
//STEPLIB DD  DSN=YOUR.COBOL.COMPILER.LOADLIB,DISP=SHR
//SYSLIB  DD  DSN=YOUR.COBOL.SRCLIB,DISP=SHR
//SYSIN   DD  DSN=YOUR.COBOL.SRCLIB(LIBMQTST),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT  DD SYSOUT=*
//SYSLIN  DD DSN=&&OBJ,UNIT=SYSDA,SPACE=(TRK,(5,5)),
//            DISP=(MOD,PASS)
/*
//LKED    EXEC PGM=HEWL,REGION=0M,COND=(0,LT)
//SYSLMOD DD DSN=YOUR.COBOL.LOADLIB(LIBMQTST),DISP=SHR
//SYSLIN  DD DSN=&&OBJ,DISP=(OLD,DELETE)
//SYSLIB  DD DSN=YOUR.MQ.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
/*
