//LIBMQRUN JOB (ACCT),'RUN LIBMQTST',
//         CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*  Run MQ echo program LIBMQTST
//RUN     EXEC PGM=LIBMQTST,REGION=0M
//STEPLIB DD  DSN=YOUR.COBOL.LOADLIB,DISP=SHR
//        DD  DSN=YOUR.MQ.LOADLIB,DISP=SHR
//SYSOUT  DD  SYSOUT=*
//*
