//MQSCJOB  JOB (ACCT),'MQSC CSQ9',CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//MQSC     EXEC PGM=CSQUTIL,PARM='CSQ9'
//STEPLIB  DD  DSN=CSQ920.SCSQANLE,DISP=SHR
//         DD  DSN=CSQ920.SCSQAUTH,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  COMMAND FAILURE(STOP)
/*
//CSQUCMD  DD  *
  DEFINE QLOCAL(Z88011.MQZ3.INITQ) REPLACE

  DEFINE PROCESS(Z88011.MQZ3.LIBT.PROCESS) +
         APPLTYPE(CICS) +
         APPLICID(LIBT) +
         USERDATA(LIBT) +
         REPLACE

  ALTER QLOCAL(Z88011.MQZ3.QLOCAL) +
        TRIGGER +
        TRIGTYPE(FIRST) +
        INITQ(Z88011.MQZ3.INITQ) +
        PROCESS(Z88011.MQZ3.LIBT.PROCESS)
/*